//Бектенова Диана 21ИС
//Определить является ли массив палиндромом, т.е. первый элемент равен последнему, второй предпоследнему и т.д. Входные данные: Первая строка число N, (N>0) - длина массива. Длина массива не более 100 элементов. Вторая строка N целых чисел, записанных через пробел. Выходные данные: YES - если массив является палиндромом, NO - в противном случае.
#include <stdio.h>
int main(void) {
  int n;
    scanf("%d",&n);
    int a[n];
    int b=1;
    int c=n/2;
    for(int i=0;i<n;i++){
        scanf("%d",&a[i]);       
    } 
    for(int i=1;i<=c;i++){
        for(int j=n;j>=c;j--){
            if(a[i]!=a[j]){
              b=0;
                break;
            }
        
        }
    }
   if(b==1)
        printf("YES");
    else
        printf("NO");   
}
